src/cfe/КСП/Documents/КСП_ПланПродажПоКоллекциям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>КСП_ПланПродажПоКоллекциям</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.КСП_ПланыПродаж</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Коллекция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КоллекцииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>План</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПланПродаж</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cfe/КСП/Documents/КСП_ПланПродажПоКоллекциям/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбновитьДерево(ОбновитьПринудительно = Ложь)
	
	Если ОбновитьПринудительно ИЛИ Модифицированность Тогда	
		ОбновитьДеревоНаСервере();	
	КонецЕсли;

КонецПроцедуры

Процедура ОбновитьДеревоНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тзПлан.Клиент КАК Клиент,
		|	тзПлан.ПланПродаж КАК ПланПродаж
		|ПОМЕСТИТЬ втПлан
		|ИЗ
		|	&тзПлан КАК тзПлан
		|;
		|    
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Партнеры.Родитель КАК Родитель,
		|	Партнеры.Ссылка КАК Клиент,
		|	втПлан.ПланПродаж КАК ПланПродаж
		|ИЗ
		|	Справочник.Партнеры КАК Партнеры
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПлан КАК втПлан
		|		ПО Партнеры.Ссылка = втПлан.Клиент
		|ГДЕ
		|	Партнеры.Ссылка В ИЕРАРХИИ (&Партнеры)";
	
	тзПлан = Объект.План.Выгрузить();
	Запрос.УстановитьПараметр("тзПлан", тзПлан);
	Запрос.УстановитьПараметр("Партнеры", тзПлан.ВыгрузитьКолонку("Клиент"));
	
	ВыборкаИерархии = Запрос.Выполнить().Выбрать();
	//Запрос.Выполнить().Выгрузить()
	
	ДеревоЗначений = Новый ДеревоЗначений;
	ДеревоЗначений.Колонки.Добавить("Клиент", Новый ОписаниеТипов("СправочникСсылка.Партнеры"));
	ДеревоЗначений.Колонки.Добавить("ПланПродаж", Новый ОписаниеТипов(Новый КвалификаторыЧисла(10, 2)));
	
	Пока ВыборкаИерархии.Следующий() Цикл
		
		НайденаяСтрока = ДеревоЗначений.Строки.Найти(ВыборкаИерархии.Родитель, "Клиент", Истина);
		Если НайденаяСтрока <> Неопределено Тогда
			НоваяСтрока = НайденаяСтрока.Строки.Добавить();
		Иначе
			НоваяСтрока = ДеревоЗначений.Строки.Добавить();
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаИерархии);
	
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоЗначений, "Дерево");

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьДерево(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПланПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

	ОбновитьДерево(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Развенуть(Команда)

	РазвенутьСвернутьДерево();

КонецПроцедуры

&НаКлиенте
Процедура РазвенутьСвернутьДерево(Развенуть = Истина)
	
	
	ЭлементыДерева = Дерево.ПолучитьЭлементы();
	Для каждого ЭлементДерева Из ЭлементыДерева Цикл
		
		ид = ЭлементДерева.ПолучитьИдентификатор();
		Если Развенуть Тогда
			Элементы.Дерево.Развернуть(ид, Истина);			
		иначе
			Элементы.Дерево.Свернуть(ид);						
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Свернуть(Команда)
	
	РазвенутьСвернутьДерево(Ложь);
	
КонецПроцедуры
